import datetime
import math
def printTimeStamp(name):
    print('Автор програми: ' + name)
    print('Час компіляції: ' + str(datetime.datetime.now()))
Mg = float(input('Введіть магнітуду(ML):'))
if Mg <= 2.0 :
	print('Мікро\nМікроземлетруси, не відчуваються.')
elif Mg >= 2.0 and Mg <= 3.0 :
	print('Дуже слабкий\nЯк правило не відчуваються, але реєструються.')
elif Mg >= 3.0 and Mg <= 4.0 :
	print('Слабкий\nЧасто відчуваються, дуже рідко завдають шкоди.')
elif Mg >= 4.0 and Mg <= 5.0 :
	print('Легкий\nВідчутне тремтіння речей всередині будинків, значна шкода малоймовірна.')
elif Mg >= 5.0 and Mg <= 6.0 :
	print('Помірний\nМоже завдати значної шкоди старим та погано сконструйованим будівлям на незначній території.')
elif Mg >= 6.0 and Mg <= 7.0 :
	print('Сильний\nМоже спричинити руйнацію на території до 150 км довжиною/шириною в населених регіонах.')
elif Mg >= 7.0 and Mg <= 8.0 :
	print('Дуже сильний\nЗначна руйнація на значній території.')
elif Mg >= 8.0 and Mg <= 10.0 :
	print('Великий\nСерйозна руйнація на територіях довжиною/шириною в сотні кілометрів.')
else:
	print('Рідкісно великий')
printTimeStamp("Денис")
